{
    "format": "layers-model",
    "generatedBy": "keras v3.8.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "functional_7",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batchInputShape": [ null, 9 ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer_7"
                        },
                        "name": "input_layer_7",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_35",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_35",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [ null, 9 ],
                                            "dtype": "float32",
                                            "keras_history": [ "input_layer_7", 0, 0 ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_36",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "units": 32,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_36",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [ null, 64 ],
                                            "dtype": "float32",
                                            "keras_history": [ "dense_35", 0, 0 ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_37",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "units": 32,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_37",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [ null, 32 ],
                                            "dtype": "float32",
                                            "keras_history": [ "dense_36", 0, 0 ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_38",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "units": 16,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_38",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [ null, 32 ],
                                            "dtype": "float32",
                                            "keras_history": [ "dense_37", 0, 0 ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_39",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": { "name": "float32" },
                                "registered_name": null
                            },
                            "units": 5,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": { "seed": null },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_39",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [ null, 16 ],
                                            "dtype": "float32",
                                            "keras_history": [ "dense_38", 0, 0 ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    }
                ],
                "input_layers": [ [ "input_layer_7", 0, 0 ] ],
                "output_layers": [ [ "dense_39", 0, 0 ] ]
            }
        },
        "training_config": {
            "loss": "sparse_categorical_crossentropy",
            "loss_weights": null,
            "metrics": [ "accuracy" ],
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": false,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "adam",
                    "learning_rate": 0.0010000000474974513,
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "loss_scale_factor": null,
                    "gradient_accumulation_steps": null,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [ "group1-shard1of1.bin" ],
            "weights": [
                {
                    "name": "dense_35/kernel",
                    "shape": [ 9, 64 ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_35/bias",
                    "shape": [ 64 ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_36/kernel",
                    "shape": [ 64, 32 ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_36/bias",
                    "shape": [ 32 ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_37/kernel",
                    "shape": [ 32, 32 ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_37/bias",
                    "shape": [ 32 ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_38/kernel",
                    "shape": [ 32, 16 ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_38/bias",
                    "shape": [ 16 ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_39/kernel",
                    "shape": [ 16, 5 ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_39/bias",
                    "shape": [ 5 ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}
